//Практическая работа 4.3
//Емельянов Иван ИС223
fun main() {
    print("Введите числовое значение: ")
    val score = readLine()!!.toInt()

    val grade = when {
        score in 90..100 -> "Отлично"
        score in 80..89 -> "Хорошо"
        score in 70..79 -> "Удовлетворительно"
        score in 60..69 -> "Допустимо"
        score in 0..59 -> "Неудовлетворительно"
        else -> {
            println("Некорректное значение. Введите число от 0 до 100.")
        }
    }

    println("Оценка: $grade")
}