//Практическая работа 4.12
//Емельянов Иван ИС223
fun main() {
    print("Введите страну (США, Россия, Япония и т.д.): ")
    val country = readLine()?.trim()?.uppercase() ?: return

    val nationality = when (country) {
        "США" -> "Американец"
        "РОССИЯ" -> "Русский"
        "ЯПОНИЯ" -> "Японец"
        "ФРАНЦИЯ" -> "Француз"
        "ГЕРМАНИЯ" -> "Немец"
        "КИТАЙ" -> "Китаец"
        "ИСПАНИЯ" -> "Испанец"
        else -> "Неизвестная страна"
    }

    println("Национальность для страны $country: $nationality")
}